app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("fname", "lname", "email", "password_digest", "is_admin", "status", "created_at", "updated_at") VALUES ('Test', 'User', 'testuser@email.com', '$2a$12$bpN5fEzpEwXppAcL5MEdb.yBSn/OdXZNPpi2c58U7ILP40NKECiBi', 0, 'Active', '2025-09-10 12:57:51.457014', '2025-09-10 12:57:51.457014') RETURNING "id"

    def set_user
      @user = User.find(params.expect(:id))
---
SELECT "users".* FROM "users" WHERE "users"."id" = 9 LIMIT 1